Masmiseim36/nxpSDK/boards/twrke18f/demo_apps/adc12_low_power_peripheral/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB0 (number 54), J5[2]/LPUART0_RX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_RX_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                       /* @} */

/*! @name PORTB1 (number 53), J3[2]/LPUART0_TX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_TX_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                       /* @} */

/*! @name PORTC10 (number 52), D6[C]/FTM3_CH4/LEDRD
  @{ */
#define BOARD_LED_RED1_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_LED_RED1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_LED_RED1_PIN 10U    /*!<@brief PORTC pin index: 10 */
                                  /* @} */

/*! @name PORTC11 (number 51), D7[C]/FTM3_CH5/LEDGR
  @{ */
#define BOARD_LED_GREEN1_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_LED_GREEN1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_LED_GREEN1_PIN 11U    /*!<@brief PORTC pin index: 11 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
